""" Модуль для получения суммы двух чисел """

def add(a,b):
    """Функция для посчёта суммы двух чисел

    Args:
        a (int/float): Первое слагаемое
        b (int/float): Второе слагаемое 

    Returns:
        int/float: Арифмитическое сумма двух чисел (a+b)
    """
    return a+b

def  divide(a,b):
    """Функция для подсчёта частного двух чисел.

    Args:
        a (int/float): первое слагаемое (Делимое)
        b (int/float): второе слагаемое (Делитель)

    Returns:
        int/float: Арифместическое частного двух чисел.
    """
    if b == 0:
        raise ValueError('Деление на ноль невозможно')
    return a/b
